# -*- coding: utf-8 -*-
"""
Created on Tue Nov 14 16:12:59 2017

@author: 1707501
"""
#导入需要的库
import requests
import json
import pandas as pd
import json
import urllib
import math

x_pi = 3.14159265358979324 * 3000.0 / 180.0
pi = 3.1415926535897932384626  # π
a = 6378245.0  # 长半轴
ee = 0.00669342162296594323  # 偏心率平方
dizhi = ["上海市浦东新区祝桥镇周祝公路3259号", "上海市嘉定区方泰镇宝安公路4205号,宝安公路与方伟路交汇处向南路东", "上海市嘉定区南翔镇真南路3402号，古猗庄园附近", "上海市长宁区新泾镇仙霞西路与20省道交叉口向南路东,绿地会议中心附近", "上海市浦东新区瓦屑镇周祝公路1309号，周祝公路与申江路交叉口向东，路北", "上海市闸北区永和路168号,万荣路与永和路交叉口向东路北", "上海市松江区乐都路143号,乐都路与谷阳北路交叉处东", "上海市松江区乐都路317号", "上海市嘉定区南翔镇丰翔路口126县道与丰翔支路交汇处，贝贝大酒店附近丰翔2333号", "上海市虹口区唐山路481号,上服假日酒店北外滩店对面", "上海市徐汇区虹梅路1688号,田林路路口,中环线内圈", "上海市嘉定区嘉安公路528号，嘉安公路与回城路交叉", "上海浦东新区沪南公路2787号(靠近秀沈路)", "上海市青浦区香花镇北青公路9800号，北青公路与外青松公路交叉口东北角", "上海市嘉定区嘉定镇胜竹路与胜新路交叉口处东北角，金位酒楼附近，胜竹路3750号", "周家嘴加油站", "上海市嘉定区沪宜公路3145号", "上海市嘉定区曹安路2985号,上海巨威剪折机床厂以东方向", "漕宝路加油站", "上海市静安区常德路557号（新闸路与武定路之间）", "上海市松江区沪松路1号", "上海市宝山区锦秋路2750号,陈广路与锦秋路交叉路口南侧", "上海市浦东新区杨思路2号,杨思路与济阳路交叉口东南角", "上海市浦东新区惠东路35号，南祝路与惠东路交叉口", "上海市奉贤区南奉公路与航塘公路交叉口西南，沪南公路4403号", "上海市浦东新区沪南公路3651号(近横桥路)", "上海市嘉定区江桥镇勤丰村曹安路华江支路口，曹安公路2505号", "上海市浦东新区坦直镇新坦瓦公路428号，新坦瓦公路与下盐路交叉口", "上海市闵行区吴泾镇放鹤路999号,放鹤路与尚义路交叉口以东", "上海市闵行区漕宝路1788号(漕宝路星中路)九星批发市场旁边", "上海市徐汇区龙州路588号,徐汇区第二社会福利院旁边", "上海市奉贤区南亭公路1951号，省道125与省道103交叉口向西路南", "上海市浦东新区杨高南路2029号", "上海市杨浦区内江路295号,飞轮酒店旁", "上海市普陀区沪太路857号", "上海市浦东新区锦绣路1050号（世纪公园2号门口）", "上海市浦东新区浦星路559号,芦恒路地铁站5号出口处", "上海市闸北区西藏北路551号,永兴路与西藏北路交叉口向北路西,上海市北中学附近", "上海市浦东新区哈雷路与李冰路交叉处,高科中路1176号", "上海市浦东新区苗圃路与栖山路交叉口,泾栖小区旁", "上海市杨浦区军工路2860号，水产大楼北", "上海市宝山区宝杨路2056-9号,铁山路与宝杨路交叉口东侧路南", "上海市长宁区哈密路出入境局东北向，老店新开附近（哈密路1340号）", "上海市闵行区莘朱路1058号,锦衣多服饰公司以西方向", "上海市浦东新区锦绣路11号", "昌盛加油站", "川南奉公路站", "上海市宝山区沪太路3101号", "上海市杨浦区松花江路347号,松花江路与永吉路交汇处", "上海市浦东新区六灶镇周祝公路1867号,周祝公路申家宅路段路北", "上海闵行区莘朱路1058号,近外环路出口处", "上海市嘉定区江桥镇沪宁高速公路江桥收费口东侧", "上海市杨浦区国和路800号,东方名城附近", "上海市闵行区春申路与沪金高速公路交叉口,春申路3301号", "上海市普陀区外环线服务区内，武威路与A20省道交叉口", "上海市青浦区华新镇嘉松中路4557号(白马塘桥北300米处)", "上海市宝山区月罗公路218号(月罗公路月新南路)", "上海市闵行区龙吴路4600号,龙吴路与墨江路交汇处向北路东", "上海市嘉定区真南路3402号,204国道真南路古猗庄园对面", "上海市宝山区沪太路3286号,锦秋路与沪太路交叉口向南路西,红旗汽配东", "上海市浦东新区惠南镇人民西路大川公路路口", "上海市嘉定区曹安路4082号,贤兴大酒店以东方向", "上海市长宁区延安西路曹家堰路38号，近延安西路路西", "上海市嘉定区方泰镇上海奥迪国际赛车场内,上海国际卡丁车世界旁", "上海市闵行区吴宝路298号,欣源公寓以北方向", "上海市浦东新区周浦镇沪南公路4403号,祥鹤药业公司旁", "上海市闸北区天目中路620号，天目中路与新民支路交叉处西侧", "上海市金山区亭卫公路与珠港街交叉口向北路东,翔茂新村附近，亭卫公路6606号", "上海市嘉定区陈翔路369号,上海天正门窗制造有限公司附近", "上海市浦东新区祝桥镇千汇路与221省道交叉口处路东，南奉公路4887号", "上海市徐汇区凯旋路2048号,番禺路与凯旋路交叉口向北路东,凯旋小区附近", "上海市浦东新区南芦公路1080号", "上海市浦东新区泥城镇南芦公路与222省道交叉口，海润酒店附近，南芦公路1761号", "上海市黄浦区国货路与南车站路交叉口的东南方向，国货路398号", "上海市嘉定区浏翔公路2001号(近宝安公路),上海久年物资有限公司以南方向", "上海市嘉定区南翔镇真南路4961号,真南路与古猗园路交汇处", "上海市杨浦区广德路近杨树浦路1900号，杨树浦路与广德路交汇处", "上海市松江区叶新公路3号", "上海市浦东新区赵高路1099号，赵高路与上钦路交叉口，杨园中学附近", "上海市青浦区徐泾镇明珠路420号，明珠路与徐诚路交叉", "上海市宝山区蕰川路5060号", "上海市闸北区共和新路与长安路交叉处南侧,光复路555号", "上海市青浦区外青松公路5108号,北青公路与外青松公路交叉口向南路西,", "上海市闵行区211省道与颛盛路交叉口的东北方向,日月华庭3期附近,中春路1988号", "上海市浦东新区源深路388号", "上海市浦东新区金桥路2280号，金桥路与锦绣东路交叉口", "上海市浦东新区人民西路956号,人民西路与大川公路交叉口", "上海市杨浦区中山北二路567号，江浦路与中山北二路交叉口西南方向", "上海市松江区叶榭镇嘉金高速叶榭服务区东侧,团结村中心卫生室附近", "上海市虹口区张堰镇双园村10组3788号花园城附近", "上海市闵行区三鲁公路与沈杜公路交叉口，三鲁公路2500号", "上海市浦东新区华夏东路，国美电器东,华夏东路2311号", "上海市浦东新区浦东北路2138号，浦东北路与横安路交叉", "上海市浦东新区南六公路1756号，南六公路与龄南路交叉口向南，路东", "上海市普陀区真北支路14号(真北路2192号)与中环路交叉处", "上海市浦东新区五洲大道与张杨北路交叉口,五洲大道地铁口附近", "上海市青浦区赵巷镇赵重公路275号，赵重公路与盈港东路交叉处北行，路西", "上海市浦东新区祝桥镇上海绕城高速与金亭公路交汇处向南路西", "上海市嘉定区曹安公路1760号，曹安公路与定边路交叉拐角处", "上海市虹口区四平路754号，四平路与新港路交叉口沿四平路，路东", "上海市青浦区外青松公路与鹤达路交叉口向南路西,腾骏机械附近，外青松公路3890号", "上海市徐汇区龙吴路2455号,龙吴路与华济路交叉口西北角", "上海市闵行区三鲁路4225号", "上海市黄浦区打浦路（打浦路159号）与斜士路交叉处东北方向，长春苑附近", "上海市普陀区真光路1877号,真光公园附近", "上海市青浦区沪青平公路5824号，一里港桥向西路北", "上海市闵行区虹梅南路与老沪闵路交叉处，虹梅南路1876号", "上海市宝山区一二八纪念路(一二八纪念路215号)与虎林路交叉口,昌鑫时代绿园附近", "上海市宝山区场中路3930号与守仁桥街交叉口", "上海市普陀区金沙江路与中山北路交叉口处,杏山路5号", "上海市浦东新区龙东大道与唐陆路交叉口西南方向,龙东大道2278号", "上海市浦东新区川沙路816号,金海路与川沙路交叉口", "上海市嘉定区江桥镇沪宁高速公路江桥收费口南侧", "上海市徐汇区龙吴路560号,龙吴路与黄石路交叉口向南路东", "上海市青浦区沪青平公路1538号", "上海市嘉定区徐行镇新建一路1500号", "上海市浦东新区祝桥镇上海浦东国际机场飞翱路东侧", "上海市杨浦区周家嘴路与双阳路交叉处,周家嘴路3299号", "上海市徐汇区石龙路577号，石龙路与龙川北路交叉口东行，路南侧", "上海市杨浦区市光路1200号,市光路与包头路交叉路口", "上海闸北区汶水路(汶水路15号)与粤秀路路口西侧路北,沿汶水路方向", "上海市嘉定区新成路与167县道交叉口,七乐艺术学校附近", "上海市虹口区周家嘴路678号，与公平路交叉处", "上海市宝山区沪太公路4395号,沪太路与顾太路交叉口", "上海市浦东新区龙东大道与张江路西南角路南", "上海市奉贤区庄行镇陈行村1324号,大亭公路与庄良公路交叉", "上海市金山区上海化工区大门口，天华路188号，沪杭公路与天华路交叉处", "上海市兴山区茸卫公路1100号", "上海浦东新区唐镇唐陆路2278号,龙东大道与唐陆公路路口南侧", "上海市浦东新区志伟路,顾高公路1188号,桥头饭店附近", "上海市浦东新区外高桥保税区英伦路360号", "上海市浦东新区沪南公路1133号沪南公路莲安东路口", "上海市松江区沪松公路莘砖路路口，沪松公路3391号", "上海市浦东新区华夏东路妙境北路口，绿地公寓附近,妙境北路15号", "上海市浦东新区新元南路与浩歌路交叉口西北角，浩歌路1150号", "上海市徐汇区老沪闵路与华泾路交叉口东北方向，老沪闵路1318号", "上海市奉贤区南奉公路4135号 ，奉贤青村方灯车站", "上海市徐汇区古宜路189号吴中路与古宜路交叉路口西南方向附近", "上海市普陀区铜川路825号", "上海市杨浦区杨浦大桥(下客站)，上海财经大学附属中学附近", "上海市嘉定区曹安公路与绿苑路交叉口向西路南，曹安公路4855号", "上海市嘉定区宝安公路2436号", "上海市浦东新区沪南公路9111号（近南六公路）", "上海市松江区五龙集镇沪松路915号，奔腾生产厂家附近", "上海市宝山区罗店镇月罗路2728号，与罗太路交叉口", "上海市松江区车墩镇车亭公路558号,车亭公路与泖亭路交叉口向南路西", "上海市闵行区七莘路3699号，柴家湾小区旁边", "上海市松江区荣乐中路188号，荣乐中路与人民北路交叉", "上海市浦东新区三灶镇南六公路320号,南六公路上海野生动物园路段", "上海市闵行区虹梅南路2980号（金都路口）,美琪花苑对面", "上海市浦东新区浦星路180号,芦恒路地铁站向北路西", "上海市嘉定区沪嘉高速与上海绕城高速交汇处的那方，南赵宅附近", "上海市嘉定区江桥镇丰华公路800号", "上海市浦东新区申江路672号，申江路与窑墩路交叉口向北，路东", "上海市闵行区沪青平公路2097号,沪青平公路与前云路交叉口东北方向路南", "上海市宝山区军工路4103号,与闸殷路交叉口向西,路北", "上海市嘉定区朱家桥镇沈海高速朱桥服务区西侧", "上海市普陀区真南路1749号", "上海市闸北区海宁路与浙江北路交叉口东南方向(海宁路971号)", "上海市徐汇区龙吴路889号", "上海市松江区松江区松汇西路1105号玉树路由北向南在松汇西路交叉口往东", "上海市宝山区泰和路1758号西邻，路南侧", "上海市松江区茸平路与沪松公路交叉口向西路北,茸平路12号", "上海市浦东新区新场新奉公路598号,鼎金大酒店南侧", "上海市闵行区东川路3300号，绿春路与东川路交叉处西北角", "上海市奉贤区金钱公路4348号,钱桥镇浦星公路与金钱路交叉口西南角", "上海市松江区洞泾镇莘砖公路与长施公路交叉口向西，路南", "上海市青浦区沪青平公路6285号，318国道与漕平路交叉口向西，路南", "上海市崇明县新民镇新民村1队，北新公路与向蟠公路交叉口向南路东，北新公路342号", "上海市徐汇区中山西路2026号，上海商学院对面", "上海市青浦区华新镇纪鹤公路1508号,纪鹤公路与华强街路口向南，路西", "上海市闵行区银都路与莲花南路交叉口东南处，莲花南路1483号", "上海市青浦区华新镇嘉松中路4050号", "上海市松江区佘山镇龙源路1651号，龙源路与辰花路交叉口向南，路西", "上海市浦东新区浦东北路3140号", "上海市宝山区国权北路63号,三门路与国权北路交叉口向北路东", "上海市金山区金山大道3000号,金山大道与东平北路交叉口向西路南,城河路北侧", "上海市宝山区刘行镇联杨路与20省道交叉口向东,路南", "上海市徐汇区长华路与徐梅路交叉口西北方向，长华路170号", "上海市嘉定区嘉松北路3472号,方泰镇嘉松北路与松鹤大道交汇处,松鹤石料工艺品厂附近", "上海市普陀区真南路825号", "上海市卢湾区蒙自路278号与斜土路交叉口", "上海市宝山区顾太路4662弄6号,悦林大道与沪太公路交汇处顾村公园附近", "上海市浦东新区杨思路648号，上南路与杨思路交叉处南侧", "上海市闵行区顾戴路与省20外环高速交叉口，半岛豪门南块附近，顾戴路1619号", "上海市浦东新区龙东大道1918号，张江派出所西", "上海市浦东新区川周公路2758号，申江路与川周公路路口西北角", "上海市浦东新区上南路4127号，上南路与凌兆路交叉处东南向行，路北", "上海市闵行区莲花南路(老沪闵路交叉口)莲花南路1668号,永陆小区南", "上海市徐汇区龙吴路4200号，龙吴路与墨江路交叉口向北路东", "上海市徐汇区漕宝路1000号，上海市徐汇区虹梅养老院东南", "上海市嘉定区嘉定工业开发区,群裕路与天池路交汇处,上海圣爱医院附近", "上海市普陀区金迈路28号,金迈路与金迎路交汇处", "上海市青浦区脸膛镇双菱村菱浜313号", "上海市浦东新区下沙镇，沪南公路4615号", "上海市浦东新区滨海旅游度假区环湖西三路与古棕路交汇处,上海交通大学附属第六人民医院东院附近", "上海市杨浦区杨树浦路3024号，杨树浦路与定海路交叉口，华联超市附近", "上海市徐汇区吴中路100号,桂林路与吴中路交汇处向东路北", "上海市松江区松江金玉路与富永路交叉口向东，路北", "上海市嘉定区沪宜公路4860号", "上海市金山区亭枫公路8288号,亭枫公路与王圩西路交叉口向东路北", "上海市松江区九新公路与新站路交叉口向南路西", "上海市嘉定区嘉安公路与友菊路交叉口西行，路南侧，嘉安公路2619号", "上海市嘉定区恒谐路与墨玉北路交叉口的东南方向,外青松公路685号", "上海市浦东新区江东路（凌桥）1499号", "上海市浦东新区江东路与凌海路交叉口，江东路861弄2号", "上海市宝山区宝安公路2015号，与联杨路交叉口向东", "上海市闵行区浦星公路1986号，浦星公路与联航路交叉口向北路西", "上海市普陀区南大路2889号，南大路与红柳路交叉口", "上海市杨浦区军工路2498号，一号路与军工路交叉口向北路东", "上海市静安区武定路1099号,武定路与胶州路交叉口的西南方向,金惠商务楼附近", "上海市浦东新区川南奉公路5834号，川南奉公路与下盐路交叉", "上海市嘉定区伊宁路2349号，安晓路与伊宁路交叉口东南方向", "上海市青浦区沪青平公路2528号，沪青平公路与和睦路交叉口向东，路北", "上海市浦东新区金桥镇永宁路（永宁路6-8号）与巨峰路交叉口，华高小学附近", "上海市普陀区金沙江路（金沙江路989号）与中江路交叉口，申汉小区附近", "上海市杨浦区黄浦江，港水路北水域", "上海市长宁区哈密路（800-1号）与可乐东路交叉口向南路东，东风日产锦江专营店西南", "上海市浦东新区东高路1599号", "上海市浦东新区川南奉公路2855号，川南奉公路与道新南路交叉南侧", "上海市金山区沪杭公路388号，天华路与浦卫公路交汇处", "上海市浦东新区林海公路与上南路交汇处的东方,上南路6316号", "上海市宝山区泰和路1188号，与铁山路交叉口西南角", "上海市静安区大田路180号,大田路北京西路交叉", "上海市黄浦区人民路818号，人民路与云南南路交叉", "上海市金山区朱泾镇320国道亭枫公路与沈浦泾南路交叉口向西路北,临沧小区附近", "上海市徐汇区船厂路37号,龙华中路与船厂路交汇处向北路东", "上海市普陀区中山北路1700号，中山北路与远景路交叉", "上海市嘉定区嘉定镇嘉罗公路1232号，新城公园附近", "上海市嘉定区祁连山南路2180号,真新商务楼对面", "上海市南汇区六灶镇会龙村南六公路1167号", "上海市闵行区剑川路339号（塘湾镇友爱村）", "上海市静安区余姚路581号", "上海市闵行区漕宝路1790号，地铁9号线星中路站出口处", "上海市宝山区泰和路1788号泰和路与杨泰路交汇处路南", "上海市嘉定区马陆镇浏翔公路2778号，徐家库存东南", "上海市浦东新区航头镇鹤鸣村南汇区沪南公路5258号", "上海市闵行区银都路与都园路交叉口东南方向，沪金高速银都路入口东南方向", "上海市松江区天马山镇021县道与天陆路交汇处的东南方", "上海市嘉定区塔新路855号，与倪家浜路交叉处", "上海市长宁区新泾路180号(福泉路新泾路)", "上海市金山区龙胜路731号,龙胜路与东平南路交叉口", "上海市浦东新区芦潮港镇杭湾路122号", "上海市闵行区中春路4058号", "上海市浦东新区沪南路7222号沪南路与新环西路交叉", "上海市崇明县三星镇海洪港村省道128与星虹路交叉口西南方", "上海市浦东新区合庆镇上海绕城高速合庆服务区南侧,众合农家乐附近", "上海市闸北区西藏北路796号,中华新路与西藏北路交叉口向北路西", "上海市青浦区新镇华徐公路3831号", "上海市奉贤区南奉公路与航塘公路交叉口处,海春大酒店附近,南奉公路1501号", "上海市宝山区宝杨路3076号(近杨泰路)", "上海市金山区沪杭高速公路枫泾服务区南侧", "上海市浦东新区浦星公路498号，地铁8号线芦恒路站向北", "上海市青浦区沪青平公路5876号", "上海市嘉定区嘉行公路2930号", "上海市宝山区杨行镇蕴川路1459号蕴川路与水产路交叉", "上海市浦东新区高桥镇绕城高速服务区,凌桥村路段", "上海市嘉定区墨玉南路969号，墨玉南路与曹安路交叉口向南路西", "上海市南汇区新奉公路1465号,新场镇众安村新奉公路与446乡道交叉口向南路东", "上海市浦东新区五莲路702号，张扬北路与五莲路交叉口东南角", "上海市崇明县长征公路,长征学校以南方向,长征公路3284号", "上海市杨浦区四平路与彰武路交叉处向南，四平路1230号", "上海金山区吕巷镇朱吕公路2488号,松卫南路与朱吕公路交叉口", "上海市闸北区汶水路811号，汶水路与平型关路交叉处向东，路北", "上海市奉贤区奉城镇平庄东路协新村路段路北,平庄东路东门港桥附近", "上海市宝山区南大路与制革路交叉口西北方向，南大路758号", "上海市徐汇区宜山路与虹漕路交叉口处，珀雷缇附近，宜山路771号", "上海市浦东新区南S32高速航头北侧服务区", "上海市浦东新区航头路839号,407乡道与沪南公路交叉口,东南角", "上海市崇明县向化镇人民政府附近,向化镇北沿公路451号", "上海市浦东新区东高路1599号移动通信往北，东高路510号", "上海市闵行区剑川路碧江路口，剑川路1321号", "上海市浦东新区川南奉公路2855号，川南奉公路与道新南路交叉口向南，路东", "上海市嘉定区宝钱公路5551号附近", "上海市南汇区沪南公路上南路，吴迅中学附近", "上海市金山区朱吕公路与金石北路交叉口向北路西,联新河桥附近,朱吕公路4628号", "上海市闸北区海宁路晋元路327号,晋元路与海宁路交叉口往北,红花小区西侧", "上海市宝山区泰和路与杨泰路交叉口的西北方向,泰和路1771号,俞家宅附近", "上海市奉贤区燎钦公路1552号，燎原邮政储蓄附近", "上海市浦东新区浦东南路1864号,北张家浜路北端", "上海市黄浦区成都北路118号,与大沽路交叉处北侧", "上海市崇明县新中路与团城公路交叉口向西，路北", "上海市奉贤区大叶公路1423号,邬桥镇大叶公路陈家塘路段路北", "上海市闵行区颛桥镇莘奉金高速公路颛桥服务区东侧,向阳路1369号", "上海市浦东新区申江南路7300号,新坦瓦公路与笋立路交汇处立新港笋立路桥附近", "上海市浦东新区林浦路1097号", "上海市金山区亭枫公路与兴新公路交叉口东南方向，兴塔派出所附近，亭枫公路1220号", "上海市浦东新区孙桥中心村奚家宅外环高速公路服务区西侧", "上海市长宁区虹井路840号路东，延安高架路与虹井路交叉口向北路东", "上海闸北区闸北区永和路168号永和路与万荣路交叉口向东,路北", "上海宝山区同济路555号，海江路与上海绕城公路交叉口向南路东", "上海市浦东新区504乡道与501乡道交叉口，上海赢强电器厂附近,北沿公路5号", "上海市虹口区高阳路（高阳路551号）远虹大厦旁", "上海市嘉定区安亭镇嘉松北路3472号,嘉松北路与松鹤大道交汇处", "上海市浦东新区金海路（川沙路816号）与575乡道交叉口，庙港文化公园附近", "上海市松江区闵塔路118号，松金公路与申家湖高速公路加油站", "上海市青浦区沪青平公路5518号", "上海市奉贤区钱桥镇马家宅奉拓公路与海农公路交汇处", "上海市奉贤区庄行镇南亭公路1951号,325省道南亭公路与浦卫公路交叉口,北新河桥附近", "上海市嘉定区安亭镇沈海高速入口曹安公路收费站附近", "上海市青浦区青浦镇城中东路48号，城中东路与保安交叉口向东，路南", "上海市青浦区香大路11号，香大路与外青松公路交叉口西南角", "上海市嘉定区安亭大众汽车公司内", "上海市青浦区赵巷镇垂姚村，嘉松公路5710号，嘉松公路与重姚路交叉口向南，路西", "上海市松江区方广富林路与嘉松南路交叉口向南，路西", "上海市浦东新区杨高北路3000号,五洲大道立交上", "上海市宝山区105县道与塘祁路交叉口东北角，祁连希望学校附近，塘祁路1175号", "上海市松江区荣乐西路与玉树路交叉口，永丰派出所对面，荣乐西路129号", "上海市金山区张堰镇松卫南路与漕廊公路交叉口附近", "上海市闵行区中春路北松路交叉口处，中春路995号", "上海市崇明县港西镇三双公路1231号,港西镇影剧院以南方向", "上海市闵行区纪鹤路155号，纪鹤路与纪翟路交叉", "上海市虹口区上海市虹口区中山北一路与中环路交叉口西，中山北一路1123号", "上海浦东新区启航路900号浦东国际机场迎宾大道出口处", "上海市嘉定区嘉松北路4445号，嘉松北路与泰顺路交叉处东侧", "上海市松江区佘山镇张朴村，外青松公路9609号", "上海市闵行区外环线内侧顾戴路上匝道漕宝路下匝道之间", "上海市长宁区仙霞路1310号,仙霞路与林泉路交叉口西，景博花园附近", "上海市宝山区呼兰路559号，爱辉路与呼兰路交叉口东北角", "上海市松江区新桥镇九新公路1118号，九新公路与兄妹猫路交叉口", "上海市松江区叶新公路与324省道交汇处的东方,西黄村附近", "上海市徐汇区龙吴路与龙华西路交叉处，龙吴路2号", "上海市金山区漕泾镇亭卫公路3429号,月工路与亭卫公路交汇处", "上海市嘉定区南翔镇翔江路535号,惠申路与翔江公路交叉口路南", "上海市奉贤区西渡镇沪杭公路808号，沪杭公路与大叶公路交叉", "上海市松江区车墩镇车亭公路35号，车亭公路与北松公路交叉", "上海市浦东新区南宣公路216号,南宣公路与宣中路交叉", "上海市青浦区向阳河路与125省道交叉口东北方向，第七税务所附近,北青公路8928号", "上海市嘉定区华江路391号", "上海市浦东新区华夏东路皖蓼小学东,华夏东路1200号", "上海市崇明县城桥镇，北沿公路2940号", "上海市杨浦区上海市杨浦区军工路与佳木斯路交叉口，军工路1203号", "上海市杨浦区四平路与国泰路交叉路口西南方向，四平路1805号", "上海市浦东新区航头镇航南公路169号,航鹤路与航南公路交汇处向东路南", "上海市嘉定区黄家花园路225号，黄家花园路与靖远路交叉", "上海市浦东新区江东路861弄1号", "上海市徐汇区钦州路637号,田林体育俱乐部东侧", "上海市闸北区灵石路740号，灵石路与彭越浦路交叉处向北，路东", "上海市浦东新区万祥镇万和路393号，三三公路与万和路交叉", "上海市嘉定区嘉松北路3号，省道224与国道204交叉口南", "上海市闸北区万荣路969号,万荣路与永和路交叉口东北方向,万荣阳光苑附近", "上海市金山区卫沪杭公路8888号", "上海市青浦区外青松公路9号桥7821号,果园路与外青松公路交汇处东北角", "上海市长宁区武夷路562号，上海市开元学校西北", "上海市青浦区重固镇北青公路6800号", "上海市崇明区沪陕高速长兴岛服务区西", "上海市松江区松江松卫北路1199号,省道124与中山东路交叉口向北路东", "上海市奉贤区头桥镇南奉公路与大庆西路交叉路口向东附近,新奉公路4476号", "上海市松江区虹梅南路1008号", "上海市奉贤区邬桥镇大叶公路1559号", "上海市宝山区江杨南路2546号，江杨南路与蕴藻南路交叉口向南，路西", "上海市青浦区朱家角朱家角镇318国道与复兴路交叉口向西，路北，沪青平公路6698号", "上海市闵行区向阳路与县道210交叉口向西路北，向阳路1469号", "上海市松江区嘉松南路与新松江路交叉口东北方向", "上海市嘉定区嘉行公路2498号,嘉行公路与宝钱公路交叉口东北角", "上海市浦东新区赵高路1099号，赵高路与上钦路交叉口，杨园中学附近", "上海市嘉定区曹安公路3168号,与星华路交叉处", "上海市浦东新区惠东村城南路1058", "上海市杨浦区殷高东路与江湾城路交汇处,殷高东路地铁站附近", "上海市奉贤区奉新镇奉炮公路288号，奉炮公路与人民塘路交叉处", "上海市杨浦区长阳路与黄兴路交叉口的东北方向，长阳路1673号", "上海市浦东新区商城路370号，浦城路与商城路交叉口向东，路南", "上海市浦东新区川六公路1122号八灶格邦公园北", "上海市浦东新区浦建路1161号", "上海市奉贤区洪庙镇川南奉公路8919号", "上海市青浦区公园东路555号,汇金路与公园东路交汇处西侧路南", "上海市闵行区曹行镇虹梅南路与双柏路交叉口向南路东", "上海市浦东新区沪南路2445号御桥花园桥南", "上海宝山区罗店镇太路7258号沪太路与石太路交叉", "上海市闵行区汇北公路车墩镇汇桥村4148号", "上海市奉贤区目华路188号,目华路与北河路交叉", "上海市闸北区汶水路与高平路交叉口，华联超市附近，汶水路440号", "上海市嘉定区嘉新公路1278号,与彭封路交叉口南路西", "上海市闵行区北松公路7056号", "上海市杨浦区周家嘴路1500号，周家嘴路与唐山路交汇处的西南方", "上海市金山区亭林镇南金公路6000号，与东新路交叉口西，亭林种猪厂附近", "上海市闸北区灵石路815号，灵石路与原平路交叉处向北，路西", "上海市徐汇区宛平路288号，徐家汇公园附近", "上海市浦东新区浦东北路997号,东沟中学对面", "上海市青浦区朱枫公路7345号,申嘉湖高速与朱枫公路交叉口附近", "上海市虹口区逸仙路与三门路（三门路560号）交叉处向东，路南", "上海市松江区三新路320号", "上海市徐汇区龙吴路1583号，龙吴路与罗秀路交叉", "上海市松江区三新北路与文诚路交叉口向北路西,杨断塘桥附近，三新北路575号", "上海斯浦东新区成山路上（邹平路口以东成山路810号），坐南朝北", "上海市崇明县育麟桥路与鼓浪屿路交叉口处，青梅花园附近", "上海市浦东新区南芦公路879号，南芦公路与三三公路交叉", "上海市虹口区东大名路与惠民路交叉（杨树浦路9号）", "上海市闵行区七莘路与黎安路交叉口的西北方向，七莘路1338号", "上海市金山区亭枫公路9990,亭枫公路与朱枫公路交叉口,枫景家园附近", "上海市闸北区沪太支路580号，沪太支路与交城路交叉处西南方向", "上海市普陀区古浪路与祁连山路交叉口东南方向，古浪路531号", "上海市浦东新区浦东南路2177号,南浦广场公园以北约70米", "上海市宝山区蕴川路1866号，蕴川路与友谊路交叉", "上海市松江区沪松公路2081号,泗泾镇横塘桥村九千公路与1245省道交汇处", "上海市青浦区西岑镇沪渝高速淀山湖服务区(南)", "上海市宝山区沪太路1893号", "上海市杨浦区国伟路557号，国伟宾馆斜对面（闸殷路167弄11号）", "上海市青浦区蒸淀镇沈练村老朱枫公路与老松蒸公路交叉口向东路北", "上海市嘉定区嘉松北路7501号,与罗家村路交叉口西路南", "上海市青浦区金泽镇金姚村，沪青平公路8585号", "上海市松江区九新公路与新站路交叉路口向东北方向,申新广场附近", "上海市松江区乐都路电信大楼东侧，乐都路317号", "上海市金山区板桥东路820号,板桥东路与亭卫南路交叉口", "上海市奉贤区邬桥镇省道324与汇西路交叉路向东路南,大叶公路2628号", "上海市闵行区北翟路1581号，北翟路与吴北路交汇处向西路南", "上海市奉贤区青村镇南奉公路3035号，南明路与省道221交叉口向东路南", "上海市闵行区沪青平公路625号七莘路口", "上海市青浦区外青松公路2506号", "上海市浦东新区川沙镇川环南路与妙境路交叉口,界龙花苑附近", "上海市松江区松东路环城东路口九亭镇九新公路沧石桥与盛富路交叉", "上海市嘉定区宝安公路5365号", "上海市金山区卫零北路与金康西路交叉处，卫零北路615号", "上海市青浦区沪青平公路5980号", "上海市嘉定区安亭镇博园路杨家村路段,颖奕安亭高尔夫俱乐部对面", "上海市宝山区祁连山路2479号，祁连山路与上大路交叉口东南角", "上海市浦东新区南六公路320号，与人民西路交叉口向北路东，上海野生动物园西南角", "上海市宝山区高逸路31号，高逸路与殷高路交叉口东", "上海市徐汇区中环路与宜山路交叉口处,虹梅路2028号", "上海市奉贤区金光明镇金钱公路3688号，金钱公路与贤光路交叉", "上海市宝山区逸仙路901号,地铁江湾镇对面", "上海市青浦区赵巷镇赵天昆公路与佘北公路交叉,佘北公路3339号", "上海市宝山区真北路3638号，真北路与华灵路交叉口东北方向，康泰新城附近", "上海市奉贤区青村镇海边村9373号", "上海市嘉定区江桥镇曹安路5号桥（与沪宁高速交汇附近），曹安路1405号", "上海市崇明县北沿公路3398号", "上海市崇明县崇明西河沿路与519县道交叉口，新河公路445号", "上海市闵行区虹梅南路5288号", "上海市浦东新区申江路2889号,申江路与川桥路交叉口向北路东，云桥路东侧", "上海市杨浦区殷行军工路1800号", "上海市奉贤区南桥镇,南奉公路与百齐路交叉路口向东附近,南奉公路8512号", "上海市金山区金石北路与漕廊路交汇处的西南方,金山钱圩镇金石公路2255号", "上海市浦东新区塘下公路与368县道交叉口,上海宏新纺织品公司附近,三三公路4801号", "上海市长宁区仙霞西路与剑河路（仙霞西路9号）交叉口西南角上海西郊骨科医院北边，仙霞西路129号", "上海市嘉定区胜辛南路1180号,胜辛南路与蓝裕路交叉口北路东", "上海市闸北区汶水路440号,市北中央商务园以南方向", "上海市奉贤区四团镇新四平公路2528号，川南奉公路与新四平公路交叉口", "上海市闸北区沪太路与晋城路交叉处向北,大华饭店北边，沪太路1289号", "上海市青浦区练塘镇老朱枫公路与朱枫公路交汇处", "上海市浦东新区上南路5318号", "上海市嘉定区外冈镇嘉松北路3号,嘉松北路与沪宜公路交汇处", "上海市崇明县北沿公路1307号", "上海市宝山区长江西路与江杨南路交汇处向东路北，长江西路785号，云峰钢材市场附近", "上海市浦东新区环湖西三路与古棕路交汇处，生活区西三环266号", "上海市崇明区沪陕高速长兴岛服务区东", "上海市浦东新区赵行镇周祝公路申家宅路段路北,周祝公路其成桥附近", "上海市闵行区莘松路1018号", "上海市浦东新区周祝公路2970号（咸塘港桥附近）", "上海市崇明县沪陕高速港沿服务区,北侧", "上海市长宁区天山路90号天山路双流路交叉口向北路西,天山新苑附近", "上海市杨浦区逸仙路1481号", "上海市普陀区中山北路2932号，中山北路与曹杨路交叉口东南方向，中宁汽车商厦附近", "上海市浦东新区新坦瓦公路409号,355县道与下盐路交叉口向南路西", "上海市宝山区沪太路1880号,大场镇段", "上海市奉贤区沪杭公路2178号，省道103与省道325交叉口向南路西", "上海市奉贤区南桥镇沪杭支路79号", "上海市金山区夏盛路439号（金山大道4988号）", "上海市浦东新区彭镇镇综合经济园区,南芦公路1527号", "上海市宝山区逸仙路与长江路交叉口的东北方向，吴淞海关附近，逸仙路3967号", "上海市浦东新区龙东大道4185号，白金瀚宫北", "上海市浦东新区金桥镇金桥路2280号,金桥路与金秀东路加油站", "上海市徐汇区虹漕南路15号,虹漕南路与漕宝路交叉处向南,路东", "上海市青浦区西岑镇沪渝高速淀山湖服务区(北)", "上海市浦东新区沪芦高速公路临港服务区临港收费站", "上海市青浦区商榻镇商周路200号，商周路与港娄路交叉", "上海市南汇区南六公路281号,南六公路与人民西路交叉口向北路西", "上海市青浦区环城镇塘郁村外青松公路与青松路交接处向东南路东北", "上海市嘉定区黄渡镇曹安公路4680号黄沈村", "上海市浦东新区老果公路688号与新欣路交叉往北，新港镇北", "上海市浦东新区机场镇浦东机场内，东护航路与海天东二路交叉口向东，路南", "上海市奉贤区柘林镇沪杭公路3788号,路北", "上海市奉贤区海湾镇五四公路3475号", "上海市杨浦区营口路780号，营口路与国顺东路交叉处向南，路东", "上海市奉贤区四团镇大叶公路9048号，六奉公路与东大公路交叉口东南角", "上海市金山区漕泾镇沪杭公路与天华路交叉口，沪杭公路4402号", "上海市奉贤区胡桥镇乡道418与乡道419交叉路口东北方向附近，浦卫路9019号", "上海市浦东新区川南奉公路与道新北路交界东南侧,川南奉公路1931号", "上海市嘉定区胜辛路1616号，胜辛路与城固路交叉口向南，路东", "上海市松江区环城路临,环城路与松东路交汇处,玩库生活广场附近", "上海市奉贤区金海公路2277号", "上海市金山区亭枫公路4339号,亭枫公路与朱平公路交叉口向东路南,金山水泥厂对面", "上海市奉贤区钱桥镇东奉柘公路2668号", "上海市奉贤区胡桥镇330乡道与沪杭公路交叉口西,大沙村附近", "上海市青浦区赵巷镇公园东路555号", "上海市青浦区公园东路556号,公园东路与汇金路交叉口向西,路北", "上海市嘉定区上海赛车场F1赛车场内", "上海市宝山区宝安公路4928号", "上海市崇明县前哨农场东旺西路与东瀛路交叉口路东方向,前哨公路1号", "上海市嘉定区嘉罗公路2702号", "上海市普陀区武宁路,武宁路与中宁路交汇处,上海公路管理处", "上海市浦东新区芦潮港镇塘下公路同顺大道商务广场附近,同顺大道372号", "上海市闵行区沪闵路5588号,沪闵路沁春路交叉路口西北处幼儿园东侧", "上海市宝山区长江西路258号,上江西路与长江南路交叉", "上海市徐汇区中山西路1555号,吴中路与中山西路交叉口向南路东", "上海市杨浦区军工路（军工路4103号）与闸殷路交叉口", "上海市杨浦区眉州路750号，梅州路与龙口路交叉处北侧", "上海市浦东新区川环南路1019号川沙中学南校西", "上海市闵行区龙吴路3449号（双柏路口）", "上海市宝山区沪太路8365号与金石路交叉处", "上海市奉贤区103省道与展发路交汇处的南方,沪杭公路883号", "上海市闵行区龙吴路5258号", "上海市奉贤区新寺镇沪杭公路2515号,沪杭公路与369乡道交汇处", "上海市杨浦区军工路4966号，水产大楼附近", "上海市嘉定区金沙江路2960号，金沙江路与新郁路交叉口向东，路北", "上海市奉贤区奉城镇川南奉公路9999号", "上海市奉贤区团青公路3400号,奉海公路与团青公路交叉口向东路北", "上海市浦东新区老港镇122省道沪南公路赵家宅路段路南", "上海市松江区叶谢镇嘉金高速叶榭服务区西侧,夏家宅附近", "上海市金山区亭卫公路6511号，县道259与省道209交叉口向北路西", "上海市青浦区青浦镇淀山湖大道新青浦世纪苑小区附近", "上海市浦东新区高桥镇港城路与同港路交汇处的南方，同港路8号", "上海浦东新区泥城镇大泥公路3702-1号附近", "上海市嘉定区曹安路16号桥西首", "上海市浦东新区华夏东路3926号，华夏东路与东川公交叉口西南角", "上海市长宁区哈密路800号，哈密路与可乐东路交叉", "上海市普陀区真南路2219号,真南路与古浪路交叉口南", "上海市浦东新区耀华路650号,济阳路与耀华路交叉口西侧路南", "上海市闸北区普善路265号与中山北路交叉口的东南方向，嘉和商务中心附近，普善路265号", "上海市奉贤区江海镇海湾路1828号，沪金高速与南奉告高速交叉", "上海市浦东新区南S32高速航头服务区的南侧", "上海市闸北区中华新路970号,恒丰北路与中华新路路口东侧路南,华舟小区附近", "上海市青浦区风溪镇嘉松中路与中二路交叉嘉松中路2688号", "上海市浦东新区航南公路708号，李家弄段近林海公路路口", "上海市长宁区虹桥机场迎宾三路253号，迎宾三路与空港一路交叉", "上海市松江区辰花路,辰花路与茸兴路交汇处,莱顿小城对面", "上海市崇明县建设镇建设公路和镇中路交叉口向北路东,建设公路2230号", "上海市崇明县港沿镇港沿公路985号，港沿公路与建马公路交叉处向北，路西", "上海市崇明县竖新镇乡道515与草港公路交叉路口东北方向附近，新南村12队", "上海市松江区新车公路558号", "上海市崇明县合作镇合作公路845号", "上海市崇明县合作镇永镇村4队", "上海市崇明县537县道与向化公路交汇处的东南方，向化村12队，陈彷公路5001号", "上海市宝山区刘行镇沪太公路与悦林大道交汇处", "上海市虹口区场中路121号", "上海市奉贤区邵厂镇彭平公路621号", "上海市奉贤区洪朱路3426号，奉城镇洪庙村洪朱公路向北洪庙二小附近", "上海市嘉定区嘉定镇博乐南路128号，博乐南路与嘉罗公路交叉口东南方向，蓝宫大饭店附近", "上海市奉贤区沪杭公路1807号，省道306与省道103交叉口东北处", "上海市闵行区沧源路交大三号门", "上海市嘉定区胜辛南路1180号,沁园别墅北区东门对面,百寿桥旁边", "上海市浦东新区川沙路816号,金海路与川沙路交叉口", "上海市奉贤区汇中路1819号,金钱公路与汇中路交汇处", "上海市金山区朱枫公路松泾镇朱枫公路788号，朱枫公路与枫湾路交叉口向南路东", "上海市宝山区淞宝路与牡丹江路交叉处，吴淞长途汽车站附近，牡丹江路143号", "上海市青浦区金泽镇新池村，318国道与新杨公路交叉口", "上海市金山区金山廊下镇漕廊公路9255号1层", "上海市浦东新区高桥镇1501国道凌桥村路段服务区北侧,路家浜附近", "上海市长宁区由西向东安顺路与凯旋路（凯旋路1309号）交叉口向北,当代新华小区附近", "上海市嘉定区安亭镇曹安公路5387号,金桂新村以西", "上海市虹口区凉城路(凉城路1321号)与场中路交叉口西南方向,阳发娱乐城附近", "上海市青浦区白鹤镇安鹤路与外青松公路交汇处的北方，路西", "上海市浦东新区川南奉公路7669号,川南奉公路与万金路交叉口向南路东", "上海市宝山区宝安公路1253,宝安公路与姜家村路交叉路口,东南角", "上海市嘉定区安新村宝钱路336号安", "上海市浦东新区海徐路与东集路交界北侧,外环线海徐公路815号", "上海市奉贤区平安镇四平公路建设银行向东附近,四平公路1345号", "上海市宝山区蕴川路5060号，蕴川路与杨鑫路交叉", "上海嘉定区娄唐镇嘉唐公路1138号，嘉唐公路与宝线公路交叉", "上海市青浦区陆行泾北青公路与漕盈公路交叉口附近", "上海市松江区广富林路洞泾港桥(茸惠路近广富林路路口)", "上海市卢湾区长乐路（长乐路398号）与瑞金一路交叉口的西北方向，锦江迪生商厦东边", "上海市杨浦区中山北二路567号，中山北二路与江浦路交叉处以南", "上海市闵行区沪闵路5515号", "上海市崇明县团城公路,团城公路与嘉龙南路交汇处", "上海市嘉定区澄浏中路1505号,澄浏中路与徐曹路交叉", "上海市松江区小昆山镇松蒸公路,昆港公路与松蒸公路路口东侧，松蒸公路1359号", "上海市徐汇区虹漕南路（漕宝路320号）与漕宝路交叉口德东南方向，明申商务广场附近", "上海市金山区新农镇320国道亭枫公路与金石南路交叉口向东路南,杨家村附近", "上海市闵行区莲花南路2288号，212县道与向阳路交叉处西北角", "上海市浦东新区东塘路118号", "上海市松江区新桥镇民益路1028号", "上海市闵行区题桥镇徐凌村三鲁公路与061乡道交叉口", "上海市金山区沈海高速金山服务区南侧", "上海市宝山区富锦路1589号,富锦路与江阳北路交叉口", "上海市闵行区318国道与206省道交叉处西北方向，华翔路1285号", "上海市黄浦区中山南路1133号，内环高架路与中山南路交叉口东南方向，上海市第二人民医院附近", "上海市闵行区北松公路与中春路交叉口西北角，中春路959号", "上海市崇明县沪陕高速港沿服务区,南侧", "上海市青浦区重固镇崧盈路浅家宅路段路东", "上海市闸北区中山北路572号，与西藏北路路口以西上海市第二中级法院附近", "上海市闵行区姚家滨路与汇文路交叉口向北路西，三鲁路2185号", "上海市松江区S32申嘉湖高速练塘服务区,1号站", "上海市青浦区赵巷镇沪青平公路3879号，崧达路与国道G318交叉口向西路南", "上海市青浦区青赵公路1190号，青赵公路与漕盈路交叉处东侧", "上海市崇明县陈彷公路3099弄20号，陈彷公路与汲浜公路交叉口向南，路西", "上海市嘉定区华亭镇宝钱公路与浏翔公路交叉口,华亭泾桥附近", "上海市崇明县团城公路1621号", "上海市宝山区逸仙路与长逸站交叉口，建配龙家具广场附近，逸仙路3018号", "上海市奉贤区光明镇南奉公路6999号梅丽亚晶商务酒店向东18公里附近", "上海市长宁区虹桥路2550号虹桥机场内（近空港一路）", "上海市杨浦区营口路841号企航商务往北", "上海市崇明县堡镇北路737号,上海海科福利院以北方向", "上海市徐汇区龙吴路与石龙路交叉路口往北方向，西南物流商务楼附近，龙吴路400号", "上海市浦东新区塘下公路与368县道交叉口,上海宏新纺织品公司附近,三三公路4801号", "上海市杨浦区江浦路与延吉西路交叉口西北角，江浦路1903号", "上海市徐汇区中山南二路10号,瑞金南路与中山南二路交叉口", "上海青浦区朱家角镇沈砖公路1088号,上海普思新体育用品有限公司以东", "上海市嘉定区恒谐路与墨玉北路交叉口的东南方向,外青松公路685号", "上海市浦东新区唐陆路与川桥路交界东南,唐陆公路725号", "上海市崇明县永镇南坝新村北沿公路与鸽龙港路交汇处", "上海市浦东新区归泾村路180号，上浦西路与济阳路交叉口向南，路西", "上海市闸北区万荣路1501号,万荣路与万荣一路交叉口,上勤实业公司附近", "上海市青浦区青浦镇盈港路683号附近，盈港路与万寿路交叉口向东路南", "上海市嘉定区浏翔公路与陈翔路交汇处的东方", "上海市浦东新区黄楼镇川周公路黄楼花苑附近", "上海市嘉定区博园路与解放岛东环路东南角，冷链物流中心附近，博园路6220号", "上海市闵行区三鲁路611号", "上海市杨浦区三门路与逸仙路交叉口向东，路南，三门路560号", "上海市宝山区长江西路258号", "上海市崇明县三沙洪路与施翘路交叉口,上海市崇明旧机动车交易市场附近", "上海市奉贤区奉柘公路916号,奉柘公路与褚聚中心路交汇处", "上海市闵行区马桥镇北松公路1809号", "上海青浦区大盈镇青赵公路,青赵路与大盈路路口西北角", "上海市虹口区新市南路1221号", "上海市闵行区向阳路宋郎中桥附近，向阳公路1369号", "上海市金山区亭枫公路5875号，国道320与朱平公路交叉口东南", "上海市石湖荡镇松蒸公路与石泖公路交汇处", "上海市闵行区华翔路1285号", "上海市闵行区莲花南路3777号，上海西航幕墙装饰有限公司西", "上海市闵行区省道135与鹤庆路交叉口向南路东，沪闵路253号", "上海市青浦区淀西村西北方，锦商公路525号", "上海市徐汇区虹梅南路与上中西路交叉口西南角，虹梅南路505号", "上海市奉贤区大叶公路4188号,大叶公路与金海公路交叉口东路南", "上海市嘉定区徐行镇嘉行公路与新建一路交叉处，协通度假村附近嘉行公路1155号", "上海市杨浦区杨树浦路2301号，上海版权产业研究公司北", "上海市杨浦区平凉路与兰州路交叉口,平凉路988号", "上海市宝山区蕴川路1718号，蕴川路与省道322交叉口西北", "上海市奉贤区南桥镇环城东路1399号", "上海市浦东新区沙镇沪南公路4828号，沪南公路与下盐公路交叉", "上海市宝山区富锦路1218号，富锦路与锦爱路交叉口", "上海市徐汇区龙吴路889号，罗城路与龙吴路交叉口向南，路西", "上海市浦东新区浦星公路6650号,浦星公路与金大公路交叉口", "上海市浦东新区浦东大道2629号", "上海市青浦区沪青平公路与318国道交叉口的东北方向，长堤别墅附近,沪青平公路1455号", "上海市浦东新区芦潮港农场潮兴路号,上海广茂实业公司北侧", "上海市青浦区赵屯镇梅桥村白石公路2318号", "上海市奉贤星火工业开发区明城路东侧，星火公路1216号", "上海市宝山区富锦路1589号,富锦路与江阳北路交叉口", "上海市普陀区祁连山路与祁春路交叉处，祁连山路1039号", "上海市杨浦区内环路与江浦路交叉口向西路北", "上海市浦东新区中港镇中港村中港河桥东南，南果公路东侧", "上海市青浦区小蒸镇周潼村新松蒸路58号", "上海市松江区S32申嘉湖高速练塘服务区，2号站", "上海市奉贤区川南奉公路8919号,洪庙镇川南奉公路洪北村路段", "上海市闸北区天通庵路413号,宝通路与天通庵路交叉口向北移动公司旁边", "上海市闵行区七莘路3600号", "上海市卢湾区重庆南路（重庆南路275号）与徐家汇路交叉处向北，路东", "上海市嘉定区嘉定镇西塔城路889号，塔城路与204国道交叉", "上海市松江区车北松公路香山村，北松公路5967号", "上海市崇明县陈彷公路257号", "上海市崇明县长兴乡凤西路433号,凤西路与凤滨路交汇处附近", "上海市虹口区逸仙路3919号", "上海市金山区沈浦泾南路66号，金龙新街与沈浦泾南路交叉口东侧", "上海市浦东新区南团公路271号，南团公路与永春东路交叉口的东南方向", "上海市金山区沪杭高速公路枫泾服务区北侧", "上海市普陀区桃浦镇真北路（真北路3781号） 真北旅社附近", "上海市杨浦区杨树浦路1504号,崇业小区附近", "上海市金山区亭林镇西侧（亭枫公路497号）", "上海市浦东新区沪南公路3418号,沪南公路与上南路交叉口向南,路西", "上海市普陀区金沙江路971号", "上海市青浦区松蒸公路4520号，与蒸浦路交叉口西，君盛汽车修配公司旁", "上海市浦东新区机场镇浦东国际机场迎宾大道出口处东侧", "上海市松江区小昆山镇昆港公路1680号，昆港公路与文翔路交叉口东南角", "上海市宝山区322省道与铁山路交叉口东北方向,永珍贸易公司附近,宝杨路2057号", "上海市闸北区共和新路2941号与彭江路交叉口向北,路东", "上海市金山区G15沈海高速与松金公路交叉处向北路西,上海交盾物资回收有限公司附近", "上海市宝山区沪太路6345号,沪太路与东电台路交叉", "上海市嘉定区宝安公路2991号,宝安公路与嘉新公路交汇处", "上海市松江区肖泖公路姚厍村叶新公路2911号，省道124与省道324交叉口向南路东", "上海市长宁区协和路1025号（近北翟路、金钟路）附近", "上海市松江区松蒸公路与新松公路交叉口向东路南,卡富曼电缆附近，松蒸公路2151号", "上海市嘉定区安亭镇宝安公路与墨玉路交叉口向东路南", "上海市闵行区老沪闵路2533号，老沪闵路金都路口", "上海市闵行区临仓路码头", "上海市闵行区北桥镇放鹤路2685临,闵行区农业科学研究所对面", "上海市金山区漕泾镇烟漕路与胡阮路交汇处,上海斗金实业有限公司附近", "上海市崇明县合五公路868号，合五公路与向堡公路交叉口", "上海市宝山区蕴川公路辅路与共富路交叉口的东南方向,薀川路299号", "上海市金山区亭林镇红阳村，车亭公路3585号", "上海市金山区张堰镇松卫南路1008号，龙航路与松卫南路交叉口", "上海市杨浦区营口路与国顺东路交叉口以北，营口路841号", "上海市金山区漕廊公路与新村路交叉口东南方向，廊下中心小学附近，漕廊公路7803号", "上海市金山区金张公路2699号", "上海市浦东新区合庆镇益华路225号，近青暮路河道北", "上海市金山区朱行镇高楼6组，朱林路155号", "上海市浦东新区合庆镇庆丰村福庆路3号", "上海市金山区漕泾镇朱漕公路2985号阮巷村", "上海金山区张堰镇金张公路348号,上海山岛制衣有限公司以南", "上海市奉贤区柘林镇沪杭公路3392号，沪杭公路与沿村路交叉", "上海市普陀区西康路（西康路1333号）与澳门路交叉口东南方向，荣联公寓附近", "上海市宝山区江杨北路1338号", "上海市普陀区北翟路1245号（上海西郊特种油品经营部北）", "上海市金山区朱泾镇亭枫公路3728号,沈浦泾南路与亭枫公路交叉口向西路北", "上海虹口场中路242号,场中路与水电路交叉口", "上海市青浦区盈港路1580号，盈港路与漕盈路交叉口，青浦客运站内", "上海市崇明县长江公路与桂林路交叉口路东方向", "上海市青浦区华新镇嘉松公路纪鹤路口，北侧，路东", "上海市青浦区沈砖公路2719号", "上海市崇明县城桥镇西引路与南门路交汇处,观潮新村小区对面", "上海市宝山区真大路551号，真大路三岔口场中钢材现货市场附近", "上海市嘉定区宝安公路3888号，宝安公路新胜路交叉", "上海市普陀区沪太路684号，与洛川路交叉处", "上海市宝山区铁山路与水产路交叉口东南方向，铁山路150号", "上海市嘉定区华亭镇浏翔路6001号", "上海市浦东新区三墩镇扶栏村，英墩路与三宣路交汇处", "上海市崇明县北沿公路与合五公路交叉口，北沿公路700号", "上海市浦东新区金桥路2576号（金桥路三桥华阳大酒店旁）", "上海市奉贤区目华路188号，目华路沪杭公路交叉口", "上海市崇明县三星镇协力村7队，三华公路桥南，宏海公路4701号", "上海市浦东新区黄路镇川南奉公路6839号,与惠同路交叉处附近", "上海市浦东新区盐朝公路618号，盐朝公路与悦目路交叉口向西路南", "上海市崇明县彷徨镇128省道陈海公路瀛北八队路段路南", "上海市闸北区灵石路与共和新路交叉口西北方向，彭江医院附近（灵石路661号）", "上海市奉贤区四团镇221省道与天棚街交叉口西南,南奉公路8101号", "上海市奉贤区金汇镇浦星公路5511号", "上海市嘉定区曹安路13号桥附近（星华公路），曹安公路3168号", "上海市奉贤区光明镇张弄村上海绕城高速光明服务区南侧", "上海市卢湾区中山南一路453号,中山南一路与制造局路交叉口西侧，中南小区附近", "上海市杨浦区军工路1800号与嫩江路交叉处北侧，共青国家森林公园附近", "上海市崇明县北沿公路1264号", "上海市宝山区江杨南路1101号，华联超市附近", "上海市金山区金山卫镇金山大道3385号", "上海市金山区卫六路阿忠饭店往北，209省道与卫六路交叉口向南,卫六路1239号", "上海市浦东新区沪南公路9735号", "上海市嘉定区胜辛南路499号，胜辛南路与嘉美路交叉口西南方向", "上海市松江区沪松公路1112号，沪松公路与涞亭路交叉口，奥林匹克花园附近", "上海市浦东新区黄楼镇20省道瞿家港桥服务区西侧,环西小区附近", "上海市徐汇区虹漕南路777号，虹漕南路与沪闵高架路交叉口。", "上海市杨浦区军工路与海安路交叉处以东，军工路460号", "上海市宝山区爱辉路821号,呼兰路与爱辉路交汇处的西北方,路东", "上海市奉贤区柘林镇沪杭公路1688号，省道103与县道426交叉口", "上海市闵行区联明路88号，云台路与联明路交汇处", "上海市浦东新区健祥路68号,健祥路与同顺大道交叉口向西南路南", "上海市嘉定区徐行镇张金村,安新路与宝钱公路交叉口向东路南", "上海市浦东新区浦东国际机场东远航路与海天东二路交叉口东北角", "上海市闸北区(保德路35号)保德路与江杨南路交叉口西南方向,奥灵灵通信附近", "上海市崇明县堡镇北路312号，堡镇北路与德兴路交叉", "上海市浦东新区川周公路，界龙大道,川周公路6899号", "上海市闵行区陈行镇芦胜村南江榉路与浦秀路交汇处附近", "上海市金山区朱吕公路4980号，朱吕公路与金张公路交叉", "上海市闸北区洛川中路与共和新路交叉口西北方向，悠和家园附近,洛川中路733号", "上海市嘉定区宝安公路2991号,宝安公路与嘉新公路交汇处", "上海浦东新区羽山路1928号，羽山路与德平路交叉东侧", "上海市嘉定区黄渡镇曹安公路4181号黄沈村，曹联路与曹安公路交叉口向西路南", "上海市崇明区建设镇蟠龙公路483号，蟠龙公与草港公路交叉口西北角", "上海市浦东新区盐朝公路朝阳农场西,盐昭公路1365弄3号", "上海市宝山区罗泾镇新川沙路501号", "上海市宝山区新丰村北蕴川路与石太路交叉路口，薀川路5700号", "上海市奉贤区南亭公路3651号,省道325与页庄公路交叉向南路东", "上海市闵行区虹梅南路与莘朱路交叉口北，虹梅南路1008号", "上海市闵行区马桥镇国道320与中街交叉口向西路南,北松公路1809号", "上海市浦东新区唐陆路2851号，春泉路与县道582交叉口东北处", "上海市卢湾区陕西南路173号", "上海市闵行区剑漕路与申嘉湖高速公路交叉口向东路北，放鹤路1519号", "上海市南汇区南果公路909号", "上海市奉贤区新寺镇沪杭公路2432号，沪杭公路与新塘路交叉", "上海市奉贤区奉贤县新奉公路4093号，头桥镇振钱路与省道X013交叉路口向南附近", "上海市奉贤区民昌路与航塘公路交汇处的南方，路西", "上海市奉贤区泰日镇沿浦公路2499号", "上海市浦东新区三墩镇扶栏村三宣公路与358乡道交汇处附近", "上海市宝山区罗店镇石太路2160号，石太路与潘泾路交叉口东南角", "上海市松江区佘山沈砖公路3229号", "上海市闸北区中兴路1788号,在中兴路恒丰北路交叉口东南角", "上海市杨浦区军工路460号，军工路与海安路交叉处以东", "上海市崇明县海桥乡三光镇北新桥东首,海桥公路1033号", "上海市普陀区祁连山路与古浪路交叉口向南路东,祁连山路608号", "上海市嘉定区宝钱公路5009号，321省道与百安公路交叉处向西，路南", "上海市闵行区中春路4069号,中春路与沁春路交叉口路西方向", "上海市青浦区纪鹤公路与外青松路交叉口,纪鹤公路6723号", "上海市青浦区练塘镇朱枫公路与东三路交汇处北路东侧", "上海市南汇区沪芦高速公路临港收费处南侧", "上海市宝山区同济路555号", "上海市闸北区场中路2521号与三泉路口交汇处，彭浦新村附近", "上海市青浦区商塌镇青商公路湖雪村,金商公路2025号", "上海市虹口区广中路290号，广中路与水电路交叉口西南角", "上海市虹口区大连路1035号近新港路，申客小区附近", "上海市静安区康定路358号,陕西北路与康定路路口东北角", "上海市奉贤区奉城镇头桥新奉公路2490号,新奉公路与大叶公路交叉", "上海市宝山区同济路1152号(宝钢体育馆西)", "上海市普陀区金沙江路（金沙江路989号）与中江路交叉处向西", "上海市黄浦区南苏州路与四川北路交叉口东北侧，南苏州路198号", "上海市嘉定区博园路3999号，博园路与联群路交叉口向西，路南", "上海市宝山区逸仙路3919号,逸仙路与长江路交叉处西北角", "上海市黄埔区中山南二路10号", "上海市普陀区交暨路257号,交暨路与新村路路口西南角", "上海市奉贤区平庄东路4700号,平庄东路与倪家路交叉", "上海市崇明县港东乡兴北村，港东公路2199号", "上海市浦东新区书院镇院大街，书院中学北侧，老芦公路1273号", "上海市宝山区长江南路358号，长江南路长逸路交叉", "上海市金山区钱圩镇钱商大街83号，钱商大街与金石南路交叉", "上海市崇明县堡镇大通路448号，大通路与团城公路交叉", "上海市闵行区沪闵路4028号，金都路与沪闵路交叉口", "上海市松江区泗泾镇沪松公路2839号,松江区新南镇泗泾村村民委员会西侧", "上海市奉贤区324省道与金光路交叉口的西北方向，肖塘邮政局附近，大叶公路7029号", "上海市闵行区沪闵路1320号", "上海市金山区张堰镇金张支路602号", "上海市松江区洞泾镇张泾村莘砖路3638号，与张泾公路交叉口西北角", "上海市金山枫泾镇步杨村朱枫公路7665号,中洪村步杨村8组", "上海市松江区上海绕城高速小昆山服务区东侧,秦安街218号", "上海市松江区文翔路与沪松公路交叉口向南路东", "上海市普陀区新村路（新村路1391号）与真华路交叉口，家乐福附近", "上海市金山区亭卫公路1029号，亭卫公路与金山大道交叉口", "上海市浦江新区滨海旅游度假区通源西路与南果公路交界东北，通源西路1弄1号", "上海市松江区上海绕城高速小昆山服务区，秦安街218号", "上海市闵行区陪昆路与国道320交叉口向北路西，北松路3626号", "上海市宝山区顾村镇宝安公路988号", "上海市静安区余姚路581号", "上海市宝山区罗泾镇沪太路8468-1号,温桥路与徐潘路交汇处附近", "上海市宝山区共和新路与和康路交叉口处，共和新路5208号", "上海市崇明县宏海公路1787号", "上海市闵行区虹梅南路与澄江路交叉口向南路东，虹梅南路3851号", "上海市崇明县新村乡新平村星村公路1705号", "上海市虹口区和平商厦南门，大连路1035号", "上海市闵行区北青公路888号", "上海市闵行区向阳路与县道210交叉口向西路北，向阳路1469号", "上海市奉贤区新寺镇沪杭公路与369乡道交叉口,奉贤区第七地税所对面", "上海市静安区延安中路990号民立中学南面", "上海市宝山区蕴川路2381号，蕴川路与杨北路交叉", "上海市宝山区大场镇南大路387号", "上海市宝山区富锦路2685号", "上海市虹口区溧阳路1192号", "上海市长宁区伊犁路西南（虹桥宾馆往西）,伊犁路180号", "上海市金山区张泽镇亭枫公路1020号,金门村亭枫公路与松卫南路交汇处", "上海市浦东新区浦东大道2629号,浦东大道与友林路交叉", "上海市普陀区曹杨路1464号，曹杨路与固川路交叉", "上海市浦东新区上川路2489号", "上海市浦东新区芦潮港镇渔港路1184号", "上海市浦东新区合庆镇上海绕城高速合庆服务区北侧,浦东合庆新苗小学附近", "上海市金山区亭林镇亭枫公路与车亭公路交叉口,上海卧龙电动车有限公司附近", "上海市浦东新区航南公路708号,航南公路与龙丰路交叉", "上海市宝山区长兴镇凤西路与凤西一路交汇处的西南方,长兴岛凤西路433号", "上海市宝山区高境路201号，殷高西路与高境路交叉", "上海市松江区叶新公路6059号，叶新公与旺兴路交叉", "上海市崇明县绿华镇新建路831号,绿华敬老院对面", "上海市宝山区A30环城北段江杨北路服务区", "上海市奉贤区伊乐宾馆(环城东路1402-1404)", "上海市浦东新区机场镇浦东机场内，东远航路与海天东二路交汇处的东北方", "上海市崇明县宏海公路1号，陈海公路与宏海公路交汇处", "上海市金山区张堰镇松金公路2748号留溪家园往北", "上海市嘉定区博园路950号，博园路与解放岛路交叉", "上海市宝山区蕴川路5288号，蕴川路与经二延路交叉口向西", "上海市松江区松东路与环城东路交叉口，环城路501临", "上海市金山区新农镇亭枫公路2459号，320国道与新慧路交叉处以东", "上海市宝山区淞南镇长江南路771号,长江南路与松发路交叉", "上海市黄浦区龙华东路打浦路的交叉口西侧，龙华东路749号", "上海市虹口区天宝路837号", "上海市闵行区华漕镇沪青平公路1209号,华翔路与沪青平公路路口西北角", "上海市青浦区安亭镇安智路700号", "上海市闵行区沪闵路5588号,沪闵路沁春路交叉路口西北处幼儿园东侧", "上海市金山区新农镇西幸福村亭枫公路与金石南路交汇处路东，亭枫公路2957号", "上海市长宁区仙霞路（仙霞路588号）与水城路交叉口西南方向，水霞公园附近", "上海市崇明县陈家镇铁塔村7队，505县道与506县道交叉口", "上海市嘉定区沪太路9608号，沪太路与护民路交叉口西南", "上海市普陀区光复西路与凯旋北路交叉口处，泰新家园附近（光复西路115号）", "上海市闵行区沪闵路2778号，地铁5号线北桥站向北路西侧", "上海市闸北区中山北路157号与西宝兴路交叉口处，三阳小区附近，中山北路157号", "上海市闵行区北青公路889号", "上海市松江区石湖荡镇松蒸公路与石泖公路交叉口东栅小区对面", "上海市金山区兴塔镇亭枫公路6701号，亭枫公路与新兴路交叉", "上海市闵行区颛桥镇颛兴东路877号（莲花南路口）", "上海市闸北区场中路1980号，地铁1号线彭浦新村站往东走场中路南边", "上海市宝山区大场镇南陈路1号", "上海市青浦区沪青平公路2579号，国道318与和睦路交叉口向东路北", "上海市金山区沈海高速金山服务区北侧", "上海市浦东新区富特北路220号，奥纳路与日京路之间", "上海市浦东新区高桥镇浦东北路4313号（上海高纯气体有限公司对面），高桥公园西陆凌村附近", "上海市浦东新区川沙镇川沙路3997号，川沙路与王桥路交叉", "上海市奉贤区浦卫公路2839号,奉浦大道与浦卫公路交叉口向北路东", "上海市宝山区江杨北路1289号，与友谊路交叉口东南", "上海市宝山区淞南镇江杨北路1338号，上海钢新冶金辅料有限公司西北", "上海市奉贤区齐贤镇金钱公路与金大公路交叉，航南公路3327号", "上海市闸北区民和路251-277号，古田中学附近", "上海市普陀区新村路19号", "上海市崇明县北堡镇花园村堡镇北路与德兴路交汇处", "上海市嘉定区沙河村鹤友路与华江公路交汇处", "上海市金山区山阳镇大兴村（亭卫公路1765号）", "上海市浦东新区机场镇浦东机场内", "上海市嘉定区嘉定环城路与城北路交叉口的东北方向，桃园公寓附近,环城路1685号", "上海市嘉定区嘉定镇金沙路118号，金沙路与仓场路交叉口", "上海市普陀区桃浦镇真北路3781号,真北路与汶水路交汇处", "上海市宝山区蕴川路（6718号）罗泾镇海红村南", "上海市金山区松隐镇北首亭枫公路2060号，亭枫公路与松金公路交叉口", "上海市松江区荣乐东路荣乐东路1505号，荣乐东路与宝胜路交叉", "上海市宝山区沪太路5725号,沪太路与潘广路交叉", "上海市浦东新区龙东大道5852号", "上海市奉贤区广丰路676号", "上海市虹口区江杨南路397号，与安汾路交叉口", "上海市浦东新区华夏东路4601号，华夏东路与建光东路交叉口向东，路北", "上海市宝山区宝安公路628号", "上海市奉贤区南桥镇A4高速公路出口", "上海市金山区张堰镇松金公路与金张公路交汇处向北路东,白家村路段", "上海市金山区亭卫公路3429号,亭卫公路与蒋庄路交汇处北", "上海市崇明县陈彷公路3535号，陈彷公路与兴移路交叉口"]

# =============================================================================
# dizhi = ["上海市浦东新区祝桥镇周祝公路3259号", "上海市嘉定区方泰镇宝安公路4205号,宝安公路与方伟路交汇处向南路东", "上海市嘉定区南翔镇真南路3402号，古猗庄园附近"]
# =============================================================================


url2 = "&key=FBOBZ-VODWU-C7SVF-B2BDI-UK3JE-YBFUS&output=jsonp&pf=jsapi&ref=jsapi&cb=qq.maps._svcb3.geocoder0"
url1 = "http://apis.map.qq.com/jsapi?qt=geoc&addr="
headers = {"User-Agent":"Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/63.0.3239.132 Safari/537.36"}
print(len(dizhi))

class Geocoding:
    def __init__(self, api_key):
        self.api_key = api_key

    def geocode(self, address):
        """
        利用高德geocoding服务解析地址获取位置坐标
        :param address:需要解析的地址
        :return:
        """
        geocoding = {'s': 'rsv3',
                     'key': self.api_key,
                     'city': '全国',
                     'address': address}
        geocoding = urllib.parse.urlencode(geocoding)
        ret = urllib.request.urlopen("%s?%s" % ("http://restapi.amap.com/v3/geocode/geo", geocoding))

        if ret.getcode() == 200:
            res = ret.read()
            json_obj = json.loads(res)
            if json_obj['status'] == '1' and int(json_obj['count']) >= 1:
                geocodes = json_obj['geocodes'][0]
                lng = float(geocodes.get('location').split(',')[0])
                lat = float(geocodes.get('location').split(',')[1])
                return [lng, lat]
            else:
                return None
        else:
            return None


def gcj02_to_bd09(lng, lat):
    """
    火星坐标系(GCJ-02)转百度坐标系(BD-09)
    谷歌、高德——>百度
    :param lng:火星坐标经度
    :param lat:火星坐标纬度
    :return:
    """
    z = math.sqrt(lng * lng + lat * lat) + 0.00002 * math.sin(lat * x_pi)
    theta = math.atan2(lat, lng) + 0.000003 * math.cos(lng * x_pi)
    bd_lng = z * math.cos(theta) + 0.0065
    bd_lat = z * math.sin(theta) + 0.006
    return [bd_lng, bd_lat]


def bd09_to_gcj02(bd_lon, bd_lat):
    """
    百度坐标系(BD-09)转火星坐标系(GCJ-02)
    百度——>谷歌、高德
    :param bd_lat:百度坐标纬度
    :param bd_lon:百度坐标经度
    :return:转换后的坐标列表形式
    """
    x = bd_lon - 0.0065
    y = bd_lat - 0.006
    z = math.sqrt(x * x + y * y) - 0.00002 * math.sin(y * x_pi)
    theta = math.atan2(y, x) - 0.000003 * math.cos(x * x_pi)
    gg_lng = z * math.cos(theta)
    gg_lat = z * math.sin(theta)
    return [gg_lng, gg_lat]


def wgs84_to_gcj02(lng, lat):
    """
    WGS84转GCJ02(火星坐标系)
    :param lng:WGS84坐标系的经度
    :param lat:WGS84坐标系的纬度
    :return:
    """
    if out_of_china(lng, lat):  # 判断是否在国内
        return lng, lat
    dlat = _transformlat(lng - 105.0, lat - 35.0)
    dlng = _transformlng(lng - 105.0, lat - 35.0)
    radlat = lat / 180.0 * pi
    magic = math.sin(radlat)
    magic = 1 - ee * magic * magic
    sqrtmagic = math.sqrt(magic)
    dlat = (dlat * 180.0) / ((a * (1 - ee)) / (magic * sqrtmagic) * pi)
    dlng = (dlng * 180.0) / (a / sqrtmagic * math.cos(radlat) * pi)
    mglat = lat + dlat
    mglng = lng + dlng
    return [mglng, mglat]


def gcj02_to_wgs84(lng, lat):
    """
    GCJ02(火星坐标系)转GPS84
    :param lng:火星坐标系的经度
    :param lat:火星坐标系纬度
    :return:
    """
    if out_of_china(lng, lat):
        return lng, lat
    dlat = _transformlat(lng - 105.0, lat - 35.0)
    dlng = _transformlng(lng - 105.0, lat - 35.0)
    radlat = lat / 180.0 * pi
    magic = math.sin(radlat)
    magic = 1 - ee * magic * magic
    sqrtmagic = math.sqrt(magic)
    dlat = (dlat * 180.0) / ((a * (1 - ee)) / (magic * sqrtmagic) * pi)
    dlng = (dlng * 180.0) / (a / sqrtmagic * math.cos(radlat) * pi)
    mglat = lat + dlat
    mglng = lng + dlng
    return [lng * 2 - mglng, lat * 2 - mglat]


def bd09_to_wgs84(bd_lon, bd_lat):
    lon, lat = bd09_to_gcj02(bd_lon, bd_lat)
    return gcj02_to_wgs84(lon, lat)


def wgs84_to_bd09(lon, lat):
    lon, lat = wgs84_to_gcj02(lon, lat)
    return gcj02_to_bd09(lon, lat)


def _transformlat(lng, lat):
    ret = -100.0 + 2.0 * lng + 3.0 * lat + 0.2 * lat * lat + \
          0.1 * lng * lat + 0.2 * math.sqrt(math.fabs(lng))
    ret += (20.0 * math.sin(6.0 * lng * pi) + 20.0 *
            math.sin(2.0 * lng * pi)) * 2.0 / 3.0
    ret += (20.0 * math.sin(lat * pi) + 40.0 *
            math.sin(lat / 3.0 * pi)) * 2.0 / 3.0
    ret += (160.0 * math.sin(lat / 12.0 * pi) + 320 *
            math.sin(lat * pi / 30.0)) * 2.0 / 3.0
    return ret


def _transformlng(lng, lat):
    ret = 300.0 + lng + 2.0 * lat + 0.1 * lng * lng + \
          0.1 * lng * lat + 0.1 * math.sqrt(math.fabs(lng))
    ret += (20.0 * math.sin(6.0 * lng * pi) + 20.0 *
            math.sin(2.0 * lng * pi)) * 2.0 / 3.0
    ret += (20.0 * math.sin(lng * pi) + 40.0 *
            math.sin(lng / 3.0 * pi)) * 2.0 / 3.0
    ret += (150.0 * math.sin(lng / 12.0 * pi) + 300.0 *
            math.sin(lng / 30.0 * pi)) * 2.0 / 3.0
    return ret


def out_of_china(lng, lat):
    """
    判断是否在国内，不在国内不做偏移
    :param lng:
    :param lat:
    :return:
    """
    return not (lng > 73.66 and lng < 135.05 and lat > 3.86 and lat < 53.55)





add=[]
point_lng=[]
point_lat=[]
for line in dizhi:
    
    url = url1 + line + url2    
    try:
        response = requests.get(url,headers = headers)
              
        result = response.text[51:-1]
        #print(result) #获取解析的数据
        result1 = json.loads(result)  #生成字典
        pointx = result1['detail']['pointx']
        pointy = result1['detail']['pointy']
        add.append(line)
        point_lng.append(pointx)
        point_lat.append(pointy)   
        print(line)
# =============================================================================
#         #写文件
#         lin = line + '\t' + str(pointx) + '\t' + str(pointy) + '\n'
#         print(lin)
#         with open(r'D:\document\crawling\jiayouzhandizhi.txt','a',encoding='utf-8') as f:
#             f.write(lin)
# =============================================================================
            
            
    except:
        print('pase_error!')

new_point_lng = []
new_point_lat = []
code = []
for lng,lat in zip(point_lng,point_lat):
    lng = float(lng)
    lat = float(lat)
    new_lng,new_lat = gcj02_to_wgs84(lng,lat)
    new_point_lng.append(new_lng)
    new_point_lat.append(new_lat)
    print(new_lng)
    print(new_lat)

for i in range(len(add)):
    code.append(i)


g = Geocoding('API_KEY')

df = pd.DataFrame({ 'address' : add,
                    'WGS84_point_lng' : new_point_lng,
                    'WGS84_point_lat' : new_point_lat,
                    'code' : code
# =============================================================================
#                     'GCJ02_point_lng' : point_lng,
#                     'GCJ02_point_lat' : point_lat
# =============================================================================
                         })

    
df.to_csv('D:\document\crawling\jiayouzhandizhi_new.csv')    
    